blueant-soap-c/Linux/BaseBinding.searchUser.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://exception.blueant.axis.proventis.net/"
    xmlns:ns1="http://blueant.axis.proventis.net/"
    xmlns:ns3="http://base.blueant.axis.proventis.net/">
 <SOAP-ENV:Body>
   <ns3:searchUserRequestParameter>
    <ns3:sessionID></ns3:sessionID>
    <ns3:username></ns3:username>
    <ns3:email></ns3:email>
    <ns3:personID>0</ns3:personID>
    <ns3:permissionGroupID>0</ns3:permissionGroupID>
    <ns3:firstname></ns3:firstname>
    <ns3:lastname></ns3:lastname>
    <ns3:personalNumber></ns3:personalNumber>
    <ns3:licenseType>named</ns3:licenseType>
    <ns3:userState>active</ns3:userState>
    <ns3:foreignKey>
     <ns3:foreignID></ns3:foreignID>
     <ns3:foreignSystem></ns3:foreignSystem>
    </ns3:foreignKey>
   </ns3:searchUserRequestParameter>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
